koubei.taagoo.com/frontend/modules/scenic/controllers/ScenicController.php

SELECT * FROM `tg_koubei_service_market_order` WHERE (`shop_id`='2017032100077010000027333609') AND (`merchant_pid`='2088102169537664')
SELECT * FROM `tg_member` WHERE `user_id`='2088102169537664'
SELECT * FROM `tg_scenic` WHERE `user_id`=1
SELECT * FROM `tg_panoramic` WHERE `id`=39
SELECT * FROM `tg_headlines` WHERE `user_id`=1 ORDER BY `sort`
SELECT * FROM `tg_activity` WHERE `user_id`=1 ORDER BY `sort`
SELECT * FROM `tg_scenic_notice` WHERE `scenic_id`=2
SELECT * FROM `tg_scenic_spot` WHERE (`user_id`=1) AND (`status`=1)
---
    public function actionIndex($shop_id, $merchant_pid)
    {
        $koubeiServiceaMarketOrder = KoubeiServiceMarketOrder::find()->where(['shop_id' => $shop_id, 'merchant_pid' => $merchant_pid])->one();
        if ($koubeiServiceaMarketOrder) {
            $memberModel = Member::findOne(['user_id' => $merchant_pid]);
            if ($memberModel) {
                $scenicModel = Scenic::findOne(['user_id' => $memberModel->id]);
                if ($scenicModel) {
                    $model = Panoramic::findOne($scenicModel->panoramic_id);
                    if ($model) {
                        $shop_key = 'cache-vr-cloud_click'.$shop_id;
                        $this->count($shop_key, md5($shop_id.$merchant_pid));
                        $headlines = Headlines::find()->where(['user_id' => $memberModel->id])->orderBy('sort asc')->asArray()->all();
                        $activity = Activity::find()->where(['user_id' => $memberModel->id])->orderBy('sort asc')->asArray()->all();
                        $ScenicNotice = ScenicNotice::find()->where(['scenic_id' => $scenicModel->id])->all();
                        $scenicSpotList = ScenicSpot::find()->where(['user_id' => $memberModel->id, 'status' => 1])->all();

SELECT * FROM `tg_panoramic` WHERE `id`='39'
---
    public function actionPlayXml($id)
    {
        Yii::$app->response->format = \yii\web\Response::FORMAT_RAW;
        $headers = Yii::$app->response->headers;
        $headers->add('Content-Type', 'text/xml');
        $model = Panoramic::findOne($id);

SELECT * FROM `tg_scenic_audio` WHERE (`rel_type`=1) AND (`rel_id`='2')
---
    public function actionSpotJson()
    {
        $res = ['status' => 0, 'data' => []];
        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $id = Yii::$app->request->post('id');
        $info = ScenicSpot::find()->where(['id' => $id])->asArray()->one();
        if ($info) {
            $res['status'] = 1;
            $res['data']['info'] = $info;
            $res['data']['audio'] = ScenicAudio::find()->where(['rel_type' => 2, 'rel_id' => $id])->asArray()->all();

SELECT * FROM `tg_scenic` WHERE `id`='2'
SELECT * FROM `tg_scenic_audio` WHERE (`rel_type`=1) AND (`rel_id`='2') AND (`status`=1)
---
    public function actionScenicJson()
    {
        $res = ['status' => 0, 'data' => []];
        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $id = Yii::$app->request->post('id');
        $info = Scenic::find()->where(['id' => $id])->asArray()->one();
        if ($info) {
            $res['status'] = 1;
            $res['data']['info'] = $info;
            $res['data']['audio'] = ScenicAudio::find()->where(['rel_type' => 1, 'rel_id' => $id, 'status' => 1])->asArray()->all();

SELECT * FROM `tg_koubei_service_market_order` WHERE (`shop_id`='2017032100077010000027333609') AND (`merchant_pid`='2088102169537664')
SELECT * FROM `tg_member` WHERE `user_id`='2088102169537664'
SELECT * FROM `tg_scenic` WHERE `user_id`=1
---
    public function actionShopFilter($shop_id, $merchant_pid)
    {
        $koubeiServiceaMarketOrder = KoubeiServiceMarketOrder::find()->where(['shop_id' => $shop_id, 'merchant_pid' => $merchant_pid])->one();
        if ($koubeiServiceaMarketOrder) {
            $memberModel = Member::findOne(['user_id' => $merchant_pid]);
            if ($memberModel) {
                $scenicModel = Scenic::findOne(['user_id' => $memberModel->id]);

SELECT * FROM `tg_scenic` WHERE `id`='2'
SELECT * FROM `tg_shop` WHERE (`status`='OPEN') AND (`is_show`='T') AND (`merchant_pid`='2088102169537664')
SELECT `id`, `name` FROM `tg_category` WHERE `level`=1
SELECT * FROM `tg_voucher` WHERE `shop_id`='2015062400077000000000355176'
---
    public function actionGetScenicShop()
    {
        $res = ['status' => 0, 'data' => []];
        //$categoryId =  Yii::$app->request->post('category_id');
        Yii::$app->response->format = \yii\web\Response::FORMAT_JSON;
        $id = Yii::$app->request->post('id');

        $info = Scenic::findOne($id);
        if ($info) {
            $query =  Shop::find()->where(['status' => 'OPEN', 'is_show' => 'T', 'merchant_pid' => Yii::$app->request->post('merchant_pid')]);

            $list =$query->asArray()->all();

            $categorys = [];
            foreach (Category::find()->where(['level' => 1])->select('id,name')->asArray()->all() as $cateKey => $cateVal){
                $categorys[$cateVal['id']] = $cateVal['name'];
            }
            $shopping = ['超市便利店','亲子' ,'书店' ,'结婚', 'K歌'];
            $server = ['美发/美容/美甲','摄影' ,'宠物' ,'洗衣','运动健身'];
            if ($list) {
                foreach ($list as $key => &$row) {
                    $row['main_img_url'] = json_decode($row['pic_coll'], true)[$row['main_image']];
                    $voucherList = Voucher::find()->where(['shop_id' => $row['shop_id']])->asArray()->all();