koubei.taagoo.com/common/models/Panoramic.php

    public static function getPlayJson($id)
    {
        $returnData = [];
        $pano = Panoramic::findOne($id);

        $returnData['name'] = '';
        $returnData['lng'] = '';
        $returnData['lat'] = '';
        $returnData['address'] = '';
        $returnData['summary'] = '';
        $returnData['thumb_path'] = '';
        $returnData['play_rules'] = 1;//小行星开场
        $returnData['thumbs_opened'] = 0;//打开缩略图
        $returnData['autorotate'] = 1;//自动旋转
        $returnData['flag_publish'] = 1; // 发布全景
        $returnData['footmark'] = 0; // 足迹
        $returnData['gyro'] = 0; // 手机陀螺仪
        $returnData['comment'] = 0; // 显示说一说
        $returnData['showlogo'] = 0; // 显示logo
        $returnData['showuser'] = 1; // 作者名
        $returnData['showviewnum'] = 1; // 人气
        $returnData['showvrglasses'] = 1; // VR眼镜
        $returnData['showprofile'] = 1; // 简介
        $returnData['showpraise'] = 1; // 点赞
        $returnData['showshare'] = 1;// 分享
        $returnData['sand_table']['isOpen'] = 0; //沙盘
        //$returnData['sand_table']['sandTables'] = SandTable::getSandTable($pano);
        $returnData['scene_group']['sceneGroups'] = [];
        $returnData['angle_of_view'] = [];
        $returnData['hotspot'] = [];
        $sceneList = PanoramicList::find()->where(['panoramic_id' => $id, 'status' => 1])->orderBy('sort_val asc')->all();
---
SELECT * FROM `tg_panoramic` WHERE `id`='39'
SELECT * FROM `tg_panoramic_list` WHERE (`panoramic_id`='39') AND (`status`=1) ORDER BY `sort_val`