koubei.taagoo.com/common/models/ScenicSpot.php

    public function getThumb(){
        if($this->default_material_id){
            $material = PanoramicMaterial::findOne($this->default_material_id);
            if($material){
                return $material->getThumbs()['default'];
            }
        }
        return PanoramicList::findOne(['panoramic_id' => $this->panoramic_id, 'status' => 1])->panoramicMaterial->getThumbs()['default'];
---
SELECT * FROM `tg_panoramic_material` WHERE `id`='149'
SELECT * FROM `tg_panoramic_list` WHERE (`panoramic_id`=32) AND (`status`=1)
SELECT * FROM `tg_panoramic_material` WHERE `id`='164'